# Merge Dataframes

In [26]:
# Maruf Hossain

- Basic of Merge DataFrame

In [1]:
import pandas as pd

# Creating DataFrame

In [2]:
df1 = pd.DataFrame({
    'city':['New York','Chicago','Olandro'],
    'temperature':[21,14,15],
})
df1

       city  temperature
0  New York           21
1   Chicago           14
2   Olandro           15

In [3]:
df2 = pd.DataFrame({
    'city':['Chicago','New York','Olandro'],
    'humidity':[65,68,75],
})
df2

       city  humidity
0   Chicago        65
1  New York        68
2   Olandro        75

# Merge

## Inner Join / Join / Intersection

- Its like join between two tables/ set by using condition like "city"
- By default its inner join as per database terminology
- Inner join / join allow the join between tables with is common elements
- As per Exercise 2, its verifed that, its only join with common elements between tables
- As per set, its an intersection theory; taking common elements between two sets

In [4]:
df3 = pd.merge(df1, df2, on='city')
df3

       city  temperature  humidity
0  New York           21        68
1   Chicago           14        65
2   Olandro           15        75

## Exercise 2

In [5]:
df4 = pd.DataFrame({
    'city':['New York','Chicago','Olandro','baltimore'],
    'temperature':[21,14,15,25],
})
df4

        city  temperature
0   New York           21
1    Chicago           14
2    Olandro           15
3  baltimore           25

In [6]:
df5 = pd.DataFrame({
    'city':['Chicago','New York','San Francisco'],
    'humidity':[65,68,75],
})
df5

            city  humidity
0        Chicago        65
1       New York        68
2  San Francisco        75

In [8]:
df6 = pd.merge(df4, df5, on='city')
df6

       city  temperature  humidity
0  New York           21        68
1   Chicago           14        65

# Outer Join / Union

- It takes the arguments that is how="outer", default how arguments is "inner"
- Its union between two tables or it will join all elements regardless matched or not

In [14]:
df7 = pd.merge(df4,df5,on='city', how="outer")  # default join : inner
df7

            city  temperature  humidity
0       New York         21.0      68.0
1        Chicago         14.0      65.0
2        Olandro         15.0       NaN
3      baltimore         25.0       NaN
4  San Francisco          NaN      75.0

#### Indicator Flag in Join

- Default indicator : False
- Indicator True will show from which table data joined in table e.g in new col as _merge col: both means this data is common in both table

In [19]:
df7 = pd.merge(df4,df5,on='city', how="outer", indicator=True)
df7

            city  temperature  humidity      _merge
0       New York         21.0      68.0        both
1        Chicago         14.0      65.0        both
2        Olandro         15.0       NaN   left_only
3      baltimore         25.0       NaN   left_only
4  San Francisco          NaN      75.0  right_only

#### Left Join

- Left will join all common elements between two sets with all elements from left set
- Join all elements from left or first table + common elements from right table/ set
- Left & right tables are decided by the order in merge colums
- Default suffix is _x & _y

In [15]:
df7 = pd.merge(df4,df5,on='city', how="left")
df7

        city  temperature  humidity
0   New York           21      68.0
1    Chicago           14      65.0
2    Olandro           15       NaN
3  baltimore           25       NaN

In [20]:
df8 = pd.merge(df4,df5,on='city', how="right")
df8

            city  temperature  humidity
0        Chicago         14.0        65
1       New York         21.0        68
2  San Francisco          NaN        75

# Suffixes

- In Suffixes: in columns _x & _y is automatically append, because 'temperature' & 'humidity' these column name is common between tables
- The auto suffixes created when column names are same between tables, this is for easy identification
- Suffixes can be re-set / we can assign as per our need/ any name we can provide

In [21]:
df9 = pd.DataFrame({
    'city':['New York','Chicago','Olandro','Baltimore'],
    'temperature':[21,14,35,38],
    'humidity':[65,68,75,80],
})
df9

        city  temperature  humidity
0   New York           21        65
1    Chicago           14        68
2    Olandro           35        75
3  Baltimore           38        80

In [22]:
df10 = pd.DataFrame({
    'city':['Chicago','New York','San Fancisco'],
    'temperature':[23,15,45],
    'humidity':[68,75,80],
})
df10

           city  temperature  humidity
0       Chicago           23        68
1      New York           15        75
2  San Fancisco           45        80

In [24]:
df11 = pd.merge(df9, df10, on='city')  # Suffixes generated automatically when col name is common
df11

       city  temperature_x  humidity_x  temperature_y  humidity_y
0  New York             21          65             15          75
1   Chicago             14          68             23          68

In [25]:
df11 = pd.merge(df9, df10, on='city', suffixes = ('_left', '_right'))  # Suffixes Customization
df11

,city,temperature_left,humidity_left,temperature_right,humidity_right
0,New York,21,65,15,75
1,Chicago,14,68,23,68